Nuclei-Software/nuclei-sdk/SoC/gd32vw55x/Common/Include/gd32vw55x_rtc.h
/* RTC_BKP11 */
#define RTC_BKP11_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP12 */
#define RTC_BKP12_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP13 */
#define RTC_BKP13_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP14 */
#define RTC_BKP14_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP15 */
#define RTC_BKP15_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP16 */
#define RTC_BKP16_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP17 */
#define RTC_BKP17_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP18 */
#define RTC_BKP18_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* RTC_BKP19 */
#define RTC_BKP19_DATA                     BITS(0,31)                                  /*!< backup domain registers */

/* constants definitions */
/* structure for initialization of the RTC */
typedef struct {
    uint8_t year;                                                                      /*!< RTC year value: 0x0 - 0x99(BCD format) */
    uint8_t month;                                                                     /*!< RTC month value */
    uint8_t date;                                                                      /*!< RTC date value: 0x1 - 0x31(BCD format) */
    uint8_t day_of_week;                                                               /*!< RTC weekday value */
    uint8_t hour;                                                                      /*!< RTC hour value */
    uint8_t minute;                                                                    /*!< RTC minute value: 0x0 - 0x59(BCD format) */
    uint8_t second;                                                                    /*!< RTC second value: 0x0 - 0x59(BCD format) */
    uint16_t factor_asyn;                                                              /*!< RTC asynchronous prescaler value: 0x0 - 0x7F */
    uint16_t factor_syn;                                                               /*!< RTC synchronous prescaler value: 0x0 - 0x7FFF */
    uint32_t am_pm;                                                                    /*!< RTC AM/PM value */
    uint32_t display_format;                                                           /*!< RTC time notation */
} rtc_parameter_struct;

/* structure for RTC alarm configuration */
typedef struct {
    uint32_t alarm_mask;                                                               /*!< RTC alarm mask */
    uint32_t weekday_or_date;                                                          /*!< specify RTC alarm is on date or weekday */
    uint8_t alarm_day;                                                                 /*!< RTC alarm date or weekday value*/
    uint8_t alarm_hour;                                                                /*!< RTC alarm hour value */
    uint8_t alarm_minute;                                                              /*!< RTC alarm minute value: 0x0 - 0x59(BCD format) */
    uint8_t alarm_second;                                                              /*!< RTC alarm second value: 0x0 - 0x59(BCD format) */
    uint32_t am_pm;                                                                    /*!< RTC alarm AM/PM value */
} rtc_alarm_struct;

/* structure for RTC time-stamp configuration */
typedef struct {
    uint8_t timestamp_month;                                                           /*!< RTC time-stamp month value */
    uint8_t timestamp_date;                                                            /*!< RTC time-stamp date value: 0x1 - 0x31(BCD format) */
    uint8_t timestamp_day;                                                             /*!< RTC time-stamp weekday value */
    uint8_t timestamp_hour;                                                            /*!< RTC time-stamp hour value */
    uint8_t timestamp_minute;                                                          /*!< RTC time-stamp minute value: 0x0 - 0x59(BCD format) */
    uint8_t timestamp_second;                                                          /*!< RTC time-stamp second value: 0x0 - 0x59(BCD format) */
    uint32_t am_pm;                                                                    /*!< RTC time-stamp AM/PM value */
} rtc_timestamp_struct;

/* structure for RTC tamper configuration */
typedef struct {
    uint32_t tamper_source;                                                            /*!< RTC tamper source */
    uint32_t tamper_trigger;                                                           /*!< RTC tamper trigger */
    uint32_t tamper_filter;                                                            /*!< RTC tamper consecutive samples needed during a voltage level detection */
    uint32_t tamper_sample_frequency;                                                  /*!< RTC tamper sampling frequency during a voltage level detection */
    ControlStatus tamper_precharge_enable;                                             /*!< RTC tamper precharge feature during a voltage level detection */
    uint32_t tamper_precharge_time;                                                    /*!< RTC tamper precharge duration if precharge feature is enabled */
    ControlStatus tamper_with_timestamp;                                               /*!< RTC tamper time-stamp feature */
} rtc_tamper_struct;

/* time register value */
#define TIME_SC(regval)                    (BITS(0,6) & ((uint32_t)(regval) << 0U))    /*!< write value to RTC_TIME_SC bit field */
#define GET_TIME_SC(regval)                GET_BITS((regval),0,6)                      /*!< get value of RTC_TIME_SC bit field */

